proportion_mediated.org
\sloppy
* Meta-data                                                        :noexport:
#+TITLE:
#+AUTHOR:
#+OPTIONS: toc:nil
#+OPTIONS: ^:{}
# LATEX configurations
#+LATEX_CLASS_OPTIONS: [dvipdfmx,10pt]
#+LATEX_HEADER: %% Margin
#+LATEX_HEADER: %% \usepackage[margin=1.5cm]{geometry}
#+LATEX_HEADER: \usepackage[top=2cm, bottom=2cm, left=2cm, right=2cm, headsep=4pt]{geometry}
#+LATEX_HEADER: %% \addtolength{\topmargin}{0.3cm}
#+LATEX_HEADER: %% \addtolength{\textheight}{1.75in}
#+LATEX_HEADER: %% Math
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{wasysym}
#+LATEX_HEADER: %% Allow new page within align
#+LATEX_HEADER: \allowdisplaybreaks
#+LATEX_HEADER: \usepackage{cancel}
#+LATEX_HEADER: % % Code
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{courier}
#+LATEX_HEADER: \lstset{basicstyle=\footnotesize\ttfamily, breaklines=true, frame=single}
#+LATEX_HEADER: \usepackage[cache=false]{minted}
#+LATEX_HEADER: \usemintedstyle{vs}
#+LATEX_HEADER: %% Graphics
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{grffile}
#+LATEX_HEADER: %% DAG
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usetikzlibrary{positioning,shapes.geometric}
#+LATEX_HEADER: %% Date
#+LATEX_HEADER: \usepackage[yyyymmdd]{datetime}
#+LATEX_HEADER: \renewcommand{\dateseparator}{--}
#+LATEX_HEADER: %% Header
#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \pagestyle{fancy}
#+LATEX_HEADER: \fancyhf{} % Erase first to supress section names
#+LATEX_HEADER: \fancyhead[L]{Kazuki Yoshida} % LEFT
#+LATEX_HEADER: \fancyhead[C]{Proportion Mediated} % CENTER
#+LATEX_HEADER: \fancyhead[R]{\today} % RIGHT
#+LATEX_HEADER: \fancyfoot[C]{\thepage}
#+LATEX_HEADER: %% \fancyfoot[R]{Page \thepage\ of \pageref{LastPage}}
#+LATEX_HEADER: %% Section font size
#+LATEX_HEADER: \usepackage{sectsty}
#+LATEX_HEADER: \sectionfont{\small}
#+LATEX_HEADER: \subsectionfont{\small}
#+LATEX_HEADER: \subsubsectionfont{\small}
#+LATEX_HEADER: %% Section numbering
#+LATEX_HEADER: %% http://tex.stackexchange.com/questions/3177/how-to-change-the-numbering-of-part-chapter-section-to-alphabetical-r
#+LATEX_HEADER: %% \renewcommand\thesection{\alph{section}}
#+LATEX_HEADER: %% \renewcommand\thesubsection{\thesection.\arabic{subsection}}
#+LATEX_HEADER: %% \renewcommand{\thesubsubsection}{\thesubsection.\alph{subsubsection}}
#+LATEX_HEADER: %%
#+LATEX_HEADER: %% http://tex.stackexchange.com/questions/40067/numbering-sections-with-sequential-integers
#+LATEX_HEADER: %% \usepackage{chngcntr}
#+LATEX_HEADER: %% \counterwithout{subsection}{section}
#+LATEX_HEADER: %% enumerate
#+LATEX_HEADER: \usepackage{enumerate}
#+LATEX_HEADER: %% double space
#+LATEX_HEADER: %% \usepackage{setspace}
#+LATEX_HEADER: %% \linespread{2}
#+LATEX_HEADER: %% Paragraph Indentation
#+LATEX_HEADER: \usepackage{indentfirst}
#+LATEX_HEADER: \setlength{\parindent}{0em}
#+LATEX_HEADER: %% Spacing after headings
#+LATEX_HEADER: %% http://tex.stackexchange.com/questions/53338/reducing-spacing-after-headings
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \titlespacing      \section{0pt}{12pt plus 4pt minus 2pt}{0pt plus 2pt minus 2pt}
#+LATEX_HEADER: \titlespacing   \subsection{0pt}{12pt plus 4pt minus 2pt}{0pt plus 2pt minus 2pt}
#+LATEX_HEADER: \titlespacing\subsubsection{0pt}{12pt plus 4pt minus 2pt}{0pt plus 2pt minus 2pt}
#+LATEX_HEADER: %% Fix figures and tables by [H]
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: %% Allow URL embedding
#+LATEX_HEADER: \usepackage{url}
#+LATEX_HEADER: \usepackage{fontawesome}
#+LATEX_HEADER: \input{\string~/.emacs.d/misc/GrandMacros}
# ############################################################################ #

* Risk Difference

The proportion mediated on the counterfactual risk difference scale is defined as the first line. Once expanded into the counterfactual risk expressions, it can be transformed into an expression solely in terms of the counterfactual risk ratios.

\begin{align*}
  PM(RD)
  &= \frac{RD^{NIE}}{RD^{TE}}\\
  &= \frac{E[Y_{a,M_{a}}] - E[Y_{a,M_{a*}}]}{E[Y_{a,M_{a}}] - E[Y_{a*,M_{a*}}]}\\
  &~~~\text{Divide by }E[Y_{a*,M_{a*}}]\\
  &= \frac{\frac{E[Y_{a,M_{a}}]}{E[Y_{a*,M_{a*}}]} - \frac{E[Y_{a,M_{a*}}]}{E[Y_{a*,M_{a*}}]}}{\frac{E[Y_{a,M_{a}}]}{E[Y_{a*,M_{a*}}]} - \frac{E[Y_{a*,M_{a*}}]}{E[Y_{a*,M_{a*}}]}}\\
  &= \frac{RR^{TE} - RR^{NDE}}{RR^{TE}-1}\\
  &~~~\text{By multiplicative decomposition}\\
  &= \frac{RR^{NDE}RR^{NIE} - RR^{NDE}}{RR^{NDE}RR^{NIE}-1}\\
  &= \frac{RR^{NDE}(RR^{NIE} - 1)}{RR^{NDE}RR^{NIE}-1}\\
\end{align*}


* Odds Ratio

Assuming a rare outcome that allows approximation of RR with OR, we can approximate the proportion mediated on the counterfactual /risk difference/ scale as follows cite:vanderweeleOddsRatiosMediation2010.

\begin{align*}
  PM(RD)
  &= \frac{RR^{NDE}(RR^{NIE} - 1)}{RR^{NDE}RR^{NIE}-1}\\
  &\approx \frac{OR^{NDE}(OR^{NIE} - 1)}{OR^{NDE}OR^{NIE}-1}\\
\end{align*}

* Bibliography
# To remove "References" section header
\renewcommand{\section}[2]{}
# Following lines must be left-aligned without preceding spaces.
bibliographystyle:apalike
bibliography:~/.emacs.d/misc/zotero.bib
